trending_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @users = User.all

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "AJ"], ["LIMIT", 1]]
---
    def login
        user = User.find_by(username: params[:user][:username])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_user
        @user = User.find(params[:id])